***Reference*** https://www.tutorialspoint.com/python_pandas/python_pandas_dataframe.htm

In [33]:
import pandas as pd
dfr = pd.DataFrame()
print(dfr)

Empty DataFrame
Columns: []
Index: []

In [ ]:
import pandas as pd
list = [1,2,3,4,5]
s = pd.DataFrame(list)
print(s)

In [ ]:
import pandas as pd
data = [['Ben',10],['Troy',23],['Dell',34]]
df = pd.DataFrame(data,columns=['Name','Num'])
print(df)

In [ ]:
import pandas as pd
data = [['Alex',10],['Boy',20],['Girl',30]]
df = pd.DataFrame(data,columns = ['Name','Age'],dtype=float)
print(df)

In [ ]:
import pandas as pd
data = {'Name': ['Ahf','Ryf','Gjt'], 'Age': [1,2,3]}
df = pd.DataFrame(data)
df

In [ ]:
import pandas as pd
data = {'Name':['Art','Fht','Trh','Por','Qte'], 'Age':[9,8,7,6,5]}
df = pd.DataFrame(data, index=['Rank 1','Rank 2','Rank 3','Rank 4','Rank 5',])
print(df)

In [ ]:
import pandas as pd
data = [{'A':1,'B':2}, {'A':2,'B':5,'C':7}]
df = pd.DataFrame(data)
print(df)

In [7]:
import pandas as pd
data = [{'A':2,'B':3}, {'A':4,'B':5,'C':8}]
df = pd.DataFrame(data, index=['First','second'])
print(df)

        A  B    C
First   2  3  NaN
second  4  5  8.0

In [22]:
import pandas as pd
data = [{'A':1,'B':2}, {'A':2,'B':3,'C':5}]

df1 = pd.DataFrame(data, index=['First','Second'], columns=['A','B'])
print(df1,"\n")

df2 = pd.DataFrame(data, index=['First','Second'], columns=['A','C'])
print(df2)

        A  B
First   1  2
Second  2  3

        A    C
First   1  NaN
Second  2  5.0

In [27]:
import pandas as pd
data = {'Name': pd.Series(['Agy','Fht','Rye','Tye'], index=[1,2,3,4]),
                         'Age': pd.Series([56,43,12,54,4], index=[1,2,3,4,5])}
df = pd.DataFrame(data)
print(df)

  Name  Age
1  Agy   56
2  Fht   43
3  Rye   12
4  Tye   54
5  NaN    4

In [45]:
import pandas as pd
data = {'one': pd.Series([1,2,3,4], index=['a','b','c','d']),
       'two': pd.Series([1,2,3,4,5], index=['a','b','c','d','e'])}
df = pd.DataFrame(data)
print(df['one'])

a    1.0
b    2.0
c    3.0
d    4.0
e    NaN
Name: one, dtype: float64

In [53]:
import pandas as pd
data = {'one': pd.Series([1,2,3,4], index=['a','b','c','d']),
       'two': pd.Series([1,2,3,4,5], index=['a','b','c','d','e'])}
df = pd.DataFrame(data)

# Adding New Column
df['three'] = pd.Series([1,2,3,4,6], index=['a','b','c','d','e'])
print(df,"\n")

# Adding New Column WIth Existing Columns
df['four'] = df['one']+df['two']
df

   one  two  three
a  1.0    1      1
b  2.0    2      2
c  3.0    3      3
d  4.0    4      4
e  NaN    5      6

   one  two  three  four
a  1.0    1      1   2.0
b  2.0    2      2   4.0
c  3.0    3      3   6.0
d  4.0    4      4   8.0
e  NaN    5      6   NaN

In [58]:
import pandas as pd
data = {'one': pd.Series([1,2,3,4,5]),
       'two': pd.Series([1,2,3,4,5,6]),
       'three': pd.Series([1,2,3,4,5])}
df = pd.DataFrame(data)
print(df,"\n")

# using del function
del df['one']
print(df,"\n")

# using pop function
df.pop("two")
print(df,"\n")

   one  two  three
0  1.0    1    1.0
1  2.0    2    2.0
2  3.0    3    3.0
3  4.0    4    4.0
4  5.0    5    5.0
5  NaN    6    NaN

   two  three
0    1    1.0
1    2    2.0
2    3    3.0
3    4    4.0
4    5    5.0
5    6    NaN

   three
0    1.0
1    2.0
2    3.0
3    4.0
4    5.0
5    NaN

In [13]:
import pandas as pd
data = {'one': pd.Series([1,2,3,4,5], index=['a','b','c','d','e']),
       'two': pd.Series([1,2,3,4,5], index=['a','b','c','d','e'])}
df = pd.DataFrame(data)
df.loc['b']

one    2
two    2
Name: b, dtype: int64

In [49]:
import pandas as pd
data = {'one': pd.Series([1,2,3,4,5], index=['a','b','c','d','e']),
       'two': pd.Series([1,2,3,4,5], index=['a','b','c','d','e'])}
df = pd.DataFrame(data)
df.iloc[2]

one    3
two    3
Name: c, dtype: int64

In [29]:
import pandas as pd
data = {'one': pd.Series([1,2,3,4], index=['a','b','c','d']),
       'two': pd.Series([1,2,3,4,5], index=['a','b','c','d','e'])}
df = pd.DataFrame(data)
df[2:4]

   one  two
c  3.0    3
d  4.0    4

In [39]:
import pandas as pd
df = pd.DataFrame([[1, 2], [3, 4]], columns = ['a','b'], index=[1,2])
df2 = pd.DataFrame([[5, 6], [7, 8]], columns = ['a','b'], index=[3,4])

df = df.append(df2)
print(df)

   a  b
1  1  2
2  3  4
3  5  6
4  7  8

In [46]:
import pandas as pd

df = pd.DataFrame([[1, 2], [3, 4]], columns = ['a','b'])
df2 = pd.DataFrame([[5, 6], [7, 8]], columns = ['a','b'])

df = df.append(df2)
print(df,"\n")

print("Drop Row With Label 0\n")         # If Indexs Are Same Then Duplicates Will Also Be Droped
df = df.drop(0)
print(df)

   a  b
0  1  2
1  3  4
0  5  6
1  7  8

Drop Row With Label 0

   a  b
1  3  4
1  7  8

***DataFrame From Book***

*Creating DataFrame From List*

In [1]:
import pandas as pd
list = [1,23,4,5]
df = pd.DataFrame(list)
df

    0
0   1
1  23
2   4
3   5

In [2]:
import pandas as pd
data = [['Atd',20],['Dgt',12],['Fht',76]]
df = pd.DataFrame(data,columns=['Name','Age'])
df

  Name  Age
0  Atd   20
1  Dgt   12
2  Fht   76

*Creating DataFrame From Series*

In [8]:
import pandas as pd
student_mark = pd.Series({'Vij':89, 'Fht':100, 'Seyt':99})
student_age = pd.Series({'Vij':12, 'Fht':13, 'Seyt':11})
df = pd.DataFrame({'Marks':student_mark, 'Age':student_age})
df

      Marks  Age
Vij      89   12
Fht     100   13
Seyt     99   11

In [12]:
import pandas as pd
student_mark = pd.Series({'Vij':89, 'Fht':100, 'Seyt':99})
student_age = pd.Series({'Vij':12, 'Fht':13, 'Seyt':11})
df = pd.DataFrame({'Marks':student_mark, 'Age':student_age})
print(df)

print(df.sort_values(by=['Marks']))
print(df.sort_values(by=['Age'], ascending=False))

      Marks  Age
Vij      89   12
Fht     100   13
Seyt     99   11
      Marks  Age
Vij      89   12
Seyt     99   11
Fht     100   13
      Marks  Age
Fht     100   13
Vij      89   12
Seyt     99   11

*Creating DataFrame From Dictionary {Dictionary Of Series}*

In [20]:
import pandas as pd
import numpy as np
data = {'Name':pd.Series(['Adt','Ftr','Der','Ytu','Iou']),'English':pd.Series(np.random.randint(low=87,high=100,size=(5))),'Accounts':pd.Series([98,78,98,79,87]),
       'Maths':pd.Series([99,89,87,89,100])}
df = pd.DataFrame(data)
df

  Name  English  Accounts  Maths
0  Adt       93        98     99
1  Ftr       96        78     89
2  Der       93        98     87
3  Ytu       95        79     89
4  Iou       89        87    100

In [21]:
import pandas as pd
data = [{'Asr':98,'Gtr':87,'Ryr':99,'Ert':90,'Rew':100},
       {'Ert':76,'Htg':87,'Ght':54},
       {'Fht':98,'Tye':85,'Age':90,'Gbv':96}]
df = pd.DataFrame(data)
df

    Asr   Gtr   Ryr   Ert    Rew   Htg   Ght   Fht   Tye   Age   Gbv
0  98.0  87.0  99.0  90.0  100.0   NaN   NaN   NaN   NaN   NaN   NaN
1   NaN   NaN   NaN  76.0    NaN  87.0  54.0   NaN   NaN   NaN   NaN
2   NaN   NaN   NaN   NaN    NaN   NaN   NaN  98.0  85.0  90.0  96.0

*Selecting Accessing From DataFrame*

In [23]:
import pandas as pd
import numpy as np
data = {'Name':pd.Series(['Adt','Ftr','Der','Ytu','Iou']),'English':pd.Series(np.random.randint(low=87,high=100,size=(5))),'Accounts':pd.Series([98,78,98,79,87]),
       'Maths':pd.Series([99,89,87,89,100])}
df = pd.DataFrame(data)
df[0:3]

  Name  English  Accounts  Maths
0  Adt       92        98     99
1  Ftr       96        78     89
2  Der       94        98     87

In [37]:
import pandas as pd
import numpy as np
data = {'Name':pd.Series(['Adt','Ftr','Der','Ytu','Iou']),'English':pd.Series(np.random.randint(low=87,high=100,size=(5))),
        'Accounts':pd.Series([98,78,98,79,87]),
       'Maths':pd.Series([99,89,87,89,100])}
df = pd.DataFrame(data)
df.set_index('Name',inplace=True)                 # Changing The Index
print(df)
df.reset_index(inplace=True)                      # Reseting The DataFrame
print("\n",df)

      English  Accounts  Maths
Name
Adt        91        98     99
Ftr        92        78     89
Der        95        98     87
Ytu        89        79     89
Iou        90        87    100

   Name  English  Accounts  Maths
0  Adt       91        98     99
1  Ftr       92        78     89
2  Der       95        98     87
3  Ytu       89        79     89
4  Iou       90        87    100

In [40]:
import pandas as pd
a = [1,2,3,4,5]
df = pd.DataFrame(a)
df.columns=['Age']
df

   Age
0    1
1    2
2    3
3    4
4    5

*Adding Column To A DataFrame*

In [59]:
import pandas as pd
import numpy as np
a = [56,78,53,34,56]
df = pd.DataFrame(a, columns=['Age'])
print(df,"\n")

df['Age2'] = 45
df['Age3'] = pd.Series(np.random.randint(low=87,high=100,size=(5)))
df['Age4'] = df['Age']+df['Age2']+df['Age3']
print(df)

   Age
0   56
1   78
2   53
3   34
4   56

   Age  Age2  Age3  Age4
0   56    45    93   194
1   78    45    91   214
2   53    45    94   192
3   34    45    87   166
4   56    45    90   191

In [76]:
import pandas as pd
data = {'Name':pd.Series(['Adt','Ftr','Der','Ytu','Iou']),'English':pd.Series(np.random.randint(low=87,high=100,size=(5))),
        'Accounts':pd.Series([98,78,98,79,87]),
       'Maths':pd.Series([99,89,87,89,100])}
df = pd.DataFrame(data)
print(df)
print(df.iloc[:,[0,3]])                       #[row, column]
print(df.iloc[:,0:4])

  Name  English  Accounts  Maths
0  Adt       97        98     99
1  Ftr       97        78     89
2  Der       89        98     87
3  Ytu       90        79     89
4  Iou       95        87    100
  Name  Maths
0  Adt     99
1  Ftr     89
2  Der     87
3  Ytu     89
4  Iou    100
  Name  English  Accounts  Maths
0  Adt       97        98     99
1  Ftr       97        78     89
2  Der       89        98     87
3  Ytu       90        79     89
4  Iou       95        87    100

*Deleting A Colmun From A DataFrame*

In [82]:
import pandas as pd
data = {'Name':pd.Series(['Adt','Ftr','Der','Ytu','Iou']),'English':pd.Series(np.random.randint(low=87,high=100,size=(5))),
        'Accounts':pd.Series([98,78,98,79,87]),
       'Maths':pd.Series([99,89,87,89,100])}
df = pd.DataFrame(data)
print(df,'\n')
df.pop('Maths')          # First Method
del df['English']        # Second Method
df

  Name  English  Accounts  Maths
0  Adt       99        98     99
1  Ftr       96        78     89
2  Der       90        98     87
3  Ytu       99        79     89
4  Iou       91        87    100

  Name  Accounts
0  Adt        98
1  Ftr        78
2  Der        98
3  Ytu        79
4  Iou        87

***Binary Operations***